Revit 2015 API
FloorTypeSet Class
A set that contains floor types.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public class FloorTypeSet : APIObject,
	IEnumerable
Visual Basic
Public Class FloorTypeSet _
	Inherits APIObject _
	Implements IEnumerable
Visual C++
public ref class FloorTypeSet : public APIObject,
	IEnumerable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.FloorTypeSet
See Also
FloorTypeSet Members
Autodesk.Revit.DB Namespace